# GetBoundingBox Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundingBoxIntersectsFilter..::..GetBoundingBox Method
BoundingBoxIntersectsFilter Class See Also
---
Gets the outline being used for this filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public Outline GetBoundingBox()
```

Visual Basic
---
```text
Public Function GetBoundingBox As Outline
```

Visual C++
---
```text
public:
Outline^ GetBoundingBox()
```

# ### Return Value
The outline being used for this filter.
# See Also
BoundingBoxIntersectsFilter Class
Autodesk.Revit.DB Namespace